//
//  _1_Dua.swift
//  DuaKit
//
//  Created by Khalil Sabirov on 05.11.2024.
//

import Foundation

let _1_Dua: DuaModel = .init(
    name: .init(
        translation: "Кунут"
    ),
    sentences: [
        .init(
            arabic: "اللَّهُمَّ إِنَّا نَسْتَعِينُكَ وَنَسْتَغْفِرُكَ وَ نَسْتَهْدِكَ وَنُؤْمِنُ بِكَ وَنَتُوبُ إِلَيْكَ وَنَتَوَكَّلُ عَلَيْكَ وَنُثْنِى عَلَيْكَ الْخَيْرَ كُلَّهُ وَنَشْكُرُكَ وَلاَ نَكْفُرُكَ وَنَخْلَعُ وَنَتْرُكُ مَنْ يَفْجُرُكَ اللَّهُمَّ إِيَّاكَ نَعْبُدُ وَلَكَ نُصَلِّى وَنَسْجُدُ وَإِلَيْكَ نَسْعَى وَنَحْفِدُ نَرْجُو رَحْمَتَكَ وَنَخْشَى عَذَابَكَ إِنَّ عَذَابَكَ بِالْكُفَّارِ مُلْحِقٌ",
            translation: "О Аллах! Мы взываем к помощи Твоей, просим вести нас по верному пути, просим у Тебя прощения и каемся. Веруем и полагаемся на Тебя. Восхваляем Тебя за все блага, благодарим Тебя, и не являемся не верующими в Тебя, и отстраняемся, и отдаляемся от тех, кто ослушивается Тебя. О Аллах, Тебе мы поклоняемся, Тебе посвящаем молитвы, и пред Тобой падаем ниц, к Тебе мы устремляемся и спешим, уповая на Твою милость, и страшимся наказания Твоего, поистине наказание Твое неизбежно постигнет неверующих",
            transcription: "Аллаахумма, инна наста‘иинукя ва настагфирукь ва настахдиикя ва ну’мину бикя ва натуубу 'иляйк, ва натаваккялю 'аляйк, ва нуснии 'аляйкя-ль-хайра кулляхуу нашкурук, ва ляя накфурук ва нахля'у ва натруку маййафджурук. Аллахумма, ийа-кя на'буду, ва ля-кя нусолли ва насджуд, ва иляй-кя нас'а ва нахфид, нарджу рахмата-кя, ва нахша 'азаба-кя, инна 'азаба-кял жидда би-ль-куффари мульхик!"
        )
    ]
)
