//
//  _3_Dua.swift
//  DuaKit
//
//  Created by Khalil Sabirov on 06.11.2024.
//

import Foundation

let _3_Dua: DuaModel = .init(
    name: .init(
        translation: "При входе в туалет"
    ),
    sentences: [
        .init(
            arabic: "بِسْمِ اللَّـهِ اَللَّهُمَّ إِنِّي أَعُوذُ بِكَ مِنَ الْـخُبْثِ وَ الْـخَبَائِثِ",
            translation: "С именем Господа. О Всевышний, поистине, я прибегаю к Тебе, удаляясь от всего порочного.",
            transcription: "Входя с левой ноги, следует произнести:\n«Бисмил-ляяхь. Аллаахумма иннии а‘уузу бикя миналь-хубси валь-хабааис»"
        )
    ]
)
