//
//  _1_Fatiha.swift
//  DuaKit
//
//  Created by Khalil Sabirov on 03.11.2024.
//

import Foundation

let _1_Fatiha: DuaModel = .init(
    name: .init(
        arabic: "",
        translation: "Фатиха"
    ),
    number: 1,
    isFull: true,
    sentences: [
        .init(
            number: 1,
            arabic: "بِسْمِ اللّهِ الرَّحْمَنِ الرَّحِيمِ",
            translation: "Кызганучы һәм рәхмәт итүче булган Аллаһы Тәгаләнең исеме белән башлыйм",
            transcription: "Бисмилләәһи-ррахмәәни-ррахиим"
        ),
        .init(
            number: 2,
            arabic: "الْحَمْدُ للّهِ رَبِّ الْعَالَمِينَ",
            translation: "Барча мактау — галәмнәрнең асраучысы булган Аллаһы Тәгаләгә махсус",
            transcription: "Әлхәмдү лилләәһи раббил-гаәләмиин"
        ),
        .init(
            number: 3,
            arabic: "الرَّحْمنِ الرَّحِيمِ",
            translation: "Аллаһы — кызганучы, рәхмәт итүче",
            transcription: "Әр-рахмәәни-ррахиим"
        ),
        .init(
            number: 4,
            arabic: "مَلِكِ يَوْمِ الدِّينِ",
            translation: "Кыямәт көненең хуҗасы",
            transcription: "Мәәлики йәүми-ддиин"
        ),
        .init(
            number: 5,
            arabic: "إِيَّاكَ نَعْبُدُ وإِيَّاكَ نَسْتَعِينُ",
            translation: "Сиңа гына гыйбадәт кылабыз һәм Синнән генә ярдәм сорыйбыз",
            transcription: "Иййәәкә нәгбүдү үә иййәәкә нәстәгыин"
        ),
        .init(
            number: 6,
            arabic: "اهدِنَا الصِّرَاطَ المُستَقِيمَ",
            translation: "Безне туры юлга күндер",
            transcription: "Иһдинә-ссыирааталь-мүстәкыйим"
        ),
        .init(
            number: 7,
            arabic: "صِرَاطَ الَّذِينَ أَنعَمتَ عَلَيهِمْ غَيرِ المَغضُوبِ عَلَيهِمْ وَلاَ الضَّالِّينَ",
            translation: "Шуларның юлына — Син аларга нигъмәт бирдең. Ачуың төшкән һәм юлдан язучыларның юлыннан башка, ягъни ачуың төшкән һәм юлдан язучылар юлына күндермә",
            transcription: "Сыираата-лләзиинә әнгамтә галәйһим гайрил-мәгъдууби галәйһим үә лә-ддаальлиин"
        )
    ]
)
