//
//  _2_Bakara.swift
//  DuaKit
//
//  Created by Khalil Sabirov on 03.11.2024.
//

import Foundation

let _2_Bakara: DuaModel = .init(
    name: .init(
        arabic: "",
        translation: "Бәкара"
    ),
    number: 2,
    firstSentenceNumber: 1,
    sentences: [
        .init(
            arabic: "الم",
            translation: "Әлиф ләм мим. Мәгънәсен Аллаһы Тәгалә беләдер",
            transcription: "Әлиф ләәм мим"
        ),
        .init(
            arabic: "ذَلِكَ الْكِتَابُ لاَ رَيْبَ فِيهِ هُدًى لِّلْمُتَّقِينَ",
            translation: "Шушы китап, ягъни Коръән — һич шик юк, Аллаһыдан куркып гөнаһтан сакланучыларга туры юл күрсәтүче",
            transcription: "Зәәликәл-китәәбү ләә райбә фииһи һүдәл лил-мүттәкыиин"
        ),
        .init(
            arabic: "الَّذِينَ يُؤْمِنُونَ بِالْغَيْبِ وَيُقِيمُونَ الصَّلاةَ وَمِمَّا رَزَقْنَاهُمْ يُنفِقُونَ ",
            translation: "Алар күрмәгән нәрсәләренә ышанырлар һәм намазны торгызырлар, ягъни даими намаз укырлар, һәм Без ризыкландырган нәрсәдән нәфәка бирерләр",
            transcription: "Әлләзиинә йү’минүүнә бил-гайби үә йү-кыимүүнә-ссааләәтә үә миммәә разәкнәәһүм йүңфикуун"
        ),
        .init(
            arabic: "والَّذِينَ يُؤْمِنُونَ بِمَا أُنزِلَ إِلَيْكَ وَمَا أُنزِلَ مِن قَبْلِكَ وَبِالآخِرَةِ هُمْ يُوقِنُونَ ",
            translation: "Янә шулар: сиңа һәм синнән әүвәл иңдерелгән нәрсәгә, ягъни әүвәлге пәйгамбәрләргә иңдерелгән китапларга иман китерерләр. Янә Ахирәт көненең булуына шиксез ышанырлар",
            transcription: "Үәлләзиинә йү’минүүнә бимәә үңзилә иләйкә үә мәә үңзилә мин кабликә үә бил-әәхыиратиһүм йүүкыинүүн"
        ),
        .init(
            arabic: "أُوْلَئِكَ عَلَى هُدًى مِّن رَّبِّهِمْ وَأُوْلَئِكَ هُمُ الْمُفْلِحُونَ",
            translation: "Шулар: үзләренең Раббылары тарафыннан һидаятьтә, ягъни Аллаһы Тәгалә аларны туры юлга күндерде, һәм алар — котылучылар һәм максатка ирешүчеләр",
            transcription: "Үләә’икә галәә һүдәм мир раббиһим үә үләә’икә һүмүл-мүфлихүүн"
        )
    ]
)
