//
//  _3_Bakara.swift
//  DuaKit
//
//  Created by Khalil Sabirov on 03.11.2024.
//

import Foundation

let _3_Bakara: DuaModel = .init(
    name: .init(
        arabic: "",
        translation: "Бәкара"
    ),
    number: 2,
    sentences: [
        .init(
            number: 126,
            arabic: "وَإِذْ قَالَ إِبْرَاهِيمُ رَبِّ اجْعَلْ هَذَا بَلَدًا آمِنًا وَارْزُقْ أَهْلَهُ مِنَ الثَّمَرَاتِ مَنْ آمَنَ مِنْهُم بِاللَّهِ وَالْيَوْمِ الْآخِرِ قَالَ وَمَن كَفَرَ فَأُمَتِّعُهُ قَلِيلًا ثُمَّ أَضْطَرُّهُ إِلَى عَذَابِ النَّارِ وَبِئْسَ الْمَصِيرُ",
            translation: "Ибраһим пәйгамбәрнең ничек дога кылганын исегезгә төшерегез. «Әй минем Раббым, бу урынны иминлектә булучы шәһәр ит. Аллаһы Тәгаләгә һәм Ахирәт көненә ышанган шәһәр әһелләренә, анда торучыларга җимешләрдән ризык бир». Аллаһы Тәгалә Ибраһим хәзрәткә әйтте: «Кәфер булган кешене дөнья нигъмәтләре белән аз гына файдаландырырмын. Соңыннан бичаралык белән ут газабына сөрермен». Нинди яман кайтарылачак урын!",
            transcription: "Үә из каалә ибрааһиимү рабби-җгал һәәзәә бәләдән әәминәү-үәръзүкъ әһләһү минә-ссәмәраати мән әәмәнә минһүм билләәһи үәл-йәүмил-әәхыири каалә үә мәң кәфәра фә’үмәттигуһү калииләң сүммә әдтарруһүү иләә газәәби-ннәәри үә би’сәл-мәсыиир",
            tafsir: .init(
                author: "Ас-Саади",
                text: "Ибрахим помолился за Заповедную мечеть и попросил Аллаха сделать Мекку безопасным городом и одарить ее жителей всевозможными плодами. Затем святой пророк связал свою молитву с правоверными, подчеркнув свое почтительное отношение к Аллаху. Однако первая часть его молитвы носила общий характер, и поэтому Аллах распространил Свой ответ на его молитву на всех, кроме беззаконников. С другой стороны, пророк Ибрахим попросил Аллаха даровать жителям города пропитание и связал свою молитву только с правоверными, тогда как Аллах одаряет пропитанием как правоверных и покорных праведников, так и неверующих и ослушников. Именно поэтому Аллах возвестил, что пропитания будут удостоены все жители города, будь то мусульмане или неверующие. Мусульмане будут использовать мирские блага для поклонения Аллаху, после чего отправятся в Райские сады, а неверующие смогут наслаждаться земными благами лишь короткий срок, после чего будут насильно отправлены в самое скверное пристанище - в Огненную Преисподнюю."
            )
        ),
        .init(
            number: 127,
            arabic: "وَإِذْ يَرْفَعُ إِبْرَاهِيمُ الْقَوَاعِدَ مِنَ الْبَيْتِ وَإِسْمَاعِيلُ رَبَّنَا تَقَبَّلْ مِنَّا إِنَّكَ أَنتَ السَّمِيعُ الْعَلِيمُ",
            translation: "Янә шул вакытны исегезгә төшерегез, Ибраһим пәйгамбәр белән Исмәгыйль Кәгъбәтулланың биналарын күтәрделәр. Кәгъбәтулла бинасын тәмамлагач, һәр икесе Аллаһы Тәгаләгә ялынып-ялварып әйттеләр: «Әй безнең Раббыбыз, Син бездән шушы хәерле эшебезне кабул ит. Дөреслектә, Син догаларыбызны ишетүче, ниятләребезне белүче».",
            transcription: "Үә из йәръфәгү ибрааһиимүл-каүәәгидә минәл-бәйти үә исмәәгыилү раббәнәә тәкаббәл миннәә иннәкә әңтә-ссәмиигүл-галиим"
        ),
        .init(
            number: 128,
            arabic: "رَبَّنَا وَاجْعَلْنَا مُسْلِمَيْنِ لَكَ وَمِن ذُرِّيَّتِنَا أُمَّةً مُّسْلِمَةً لَّكَ وَأَرِنَا مَنَاسِكَنَا وَتُبْ عَلَيْنَآ إِنَّكَ أَنتَ التَّوَّابُ الرَّحِيمُ",
            translation: "Әй безнең Раббыбыз, һәр икебезне Ислам динендә нык торучы һәм ихлас ит. Безнең нәселләребездән булганнарны Сиңа итагать итүче итеп кыл. Янә безгә хаҗ гамәлләре эшләнә торган урыннарыбызны, ихрам, вокуф (тукталу), корбан урыннарын һәм башкаларны күрсәт, һәм Син безне кичер, гамәлдәге кимчелекләребезне гафу ит. Дөреслектә, Син тәүбәләрне кабул итүче, гөнаһлыларга рәхмәт кылучы.",
            transcription: "Раббәнәә үәҗгалнәә мүслимәйни ләкә үә миң зүрриййәтинәә үммәтәм мүслимәтәл-ләкә үә әринәә мәнәәсикәнәә үә түб галәйнәә иннәкә әңтә-ттәүүәәбү-ррахиим"
        ),
        .init(
            number: 129,
            arabic: "رَبَّنَا وَابْعَثْ فِيهِمْ رَسُولاً مِّنْهُمْ يَتْلُو عَلَيْهِمْ آيَاتِكَ وَيُعَلِّمُهُمُ الْكِتَابَ وَالْحِكْمَةَ وَيُزَكِّيهِمْ إِنَّكَ أَنتَ العَزِيزُ الحَكِيمُ",
            translation: "Әй безнең Раббыбыз, алар арасыннан бер пәйгамбәрне кубар. Ул пәйгамбәр аларга Синең аятьләреңне укысын, Коръәннең мәгънәләрен һәм шәригать хөкемнәрен өйрәтсен. Янә аларны көфер һәм гөнаһлардан пакьләсен. Дөреслектә, Син — җиңүче һәм куәтле хикмәт иясе».",
            transcription: "Раббәнәә үәбгәс фииһим расүүләм-минһүм йәтлүү галәйһим әәйәәтикә үә йүгәллимүһүмүл-китәәбә үәл-хикмәтә үә йү-зәккииһим иннәкә әңтәл-газиизүл-хәкиим",
            tafsir: .init(
                author: "Ас-Саади",
                text: "О Мухаммад! Помни о том, как пророки Ибрахим и Исмаил поднимали основание Каабы и терпеливо продолжали это славное начинание. Их сердца переполнялись чувством страха и надеждой. Совершая это великое благодеяние, они молили Аллаха принять его и сделать его полезным для всех людей. Они просили Аллаха сделать их и их потомков приверженцами ислама, суть которого заключается в смирении всей душой перед Господом и выполнении Его предписаний телом. Затем они попросили Аллаха показать им обряды поклонения, то есть обучить их обрядам поклонения наглядно, дабы это принесло им больше пользы. Существует мнение, что под обрядами поклонения (манасик) здесь подразумеваются все обряды паломничества, о чем свидетельствует контекст обсуждаемых аятов. Согласно другому толкованию, это откровение обладает более широким смыслом и включает в себя все религиозные предписания и обряды, в пользу чего свидетельствует общий смысл этих аятов. Слово «нусук» означает «поклонение», однако чаще всего оно используется в отношении обрядов паломничества. Именно такой смысл вкладывают в это слово в народе. В любом случае, оба пророка попросили Аллаха одарить их полезным знанием и праведными деяниями. А поскольку любой раб непременно допускает упущения и нуждается в покаянии, они попросили Аллаха всегда принимать их покаяния. Затем они попросили Его избрать посланника из числа их потомков, дабы приумножились их слава и величие. Они пожелали, чтобы люди покорились этому посланнику и надлежащим образом познали его прекрасные качества. Они пожелали, чтобы этот посланник прочел людям откровение, позаботился о нем и помог им выучить его наизусть, обучил их толкованию Писания и мудрости, очистил их души посредством праведных деяний и привил им отвращение к порочным поступкам, которые не облагораживают человеческую душу. А затем они восхвалили могущество и мудрость Аллаха и тем самым попросили Его избрать посланника из числа их потомков благодаря этим двум качествам. Аллаху действительно подвластно все сущее, и никто не способен воспротивиться Его воле. Благодаря Своей мудрости Он все расставляет по своим местам. И поэтому Он внял их молитвам и отправил к людям благородного Пророка Мухаммада, да благословит его Аллах и приветствует, пришествие которого стало милостью к потомкам Ибрахима и Исмаила, а также ко всему человечеству в целом. Именно поэтому Пророк Мухаммад, да благословит его Аллах и приветствует, говорил: «Я - следствие молитвы моего предка Ибрахима»."
            )
        ),
        .init(
            number: 130,
            arabic: "وَمَن يَرْغَبُ عَن مِّلَّةِ إِبْرَاهِيمَ إِلاَّ مَن سَفِهَ نَفْسَهُ وَلَقَدِ اصْطَفَيْنَاهُ فِي الدُّنْيَا وَإِنَّهُ فِي الآخِرَةِ لَمِنَ الصَّالِحِينَ",
            translation: "Аның милләтеннән һичкем йөз чөермәс. Мәгәр үз нәфесләрен (эчке дөньясын) белмәүчеләр, ягъни дивана һәм гакылсыз, яисә үз-үзен һәлак кылучы гына йөз чөерер. Тәхкыйк, Без Ибраһимны дөньяда пәйгамбәрлек хәлил (дус) булу белән ихтыяр иттек. Дөреслектә, ул Ибраһим ахирәттә, әлбәттә, изгеләр җөмләсеннән булыр.",
            transcription: "Үә мәй йәръгабү гам-милләти ибрааһиимә илләә мәң сәфиһә нәфсәһү үә ләкадис-тафәйнәәһү фи-ддүнйәә үә иннәһү фил-әәхыйрати ләминә-ссалихиин",
            tafsir: .init(
                author: "Ас-Саади",
                text: "Только глупые люди отворачиваются от религии Ибрахима после того, как узнают о его достоинствах и превосходствах. Такие люди ничего не знают о себе и пренебрегают собственной душой. Они довольствуются самым малым и продают свою душу за ничтожную цену. Что же касается последователей религии Ибрахима, то ими являются самые благоразумные и совершенные люди. Затем Всевышний Аллах поведал о судьбе Ибрахима в мирской жизни и после смерти. В этом мире он был избранником Аллаха, вдохновившим его на совершение праведных поступков, благодаря которым он стал одним из самых достойных и лучших людей. А в Последней жизни он будет одним из праведников, которым удастся взойти на самые высокие ступени."
            )
        ),
        .init(
            number: 131,
            arabic: "إِذْ قَالَ لَهُ رَبُّهُ أَسْلِمْ قَالَ أَسْلَمْتُ لِرَبِّ الْعَالَمِينَ",
            translation: "Шул вакыт Раббысы Ибраһимга әйтте: «Минем фәрманыма буйсын», — дип. Ибраһим г-м шул вакытта әйтте: «Мин үземне барча галәмнәрнең Раббысына тапшырдым һәм итагать итүче булдым».",
            transcription: "Из каалә ләһү раббүһү әслим каалә әсләмтү лираббил-гаәләмиин",
            tafsir: .init(
                author: "Ас-Саади",
                text: "Аллах велел Ибрахиму покориться и стать мусульманином, и он тотчас выполнил это повеление, засвидетельствовав свою искренность, приверженность единобожию, любовь к одному Аллаху и раскаяние перед Ним. А приверженность к единобожию стала его неотъемлемым качеством. Это качество он привил своим потомкам и завещал им всегда исповедовать такую религию. Он сделал свидетельство единобожия словом, которое вечно живет среди его потомков и передается из поколения в поколение. Некогда оно дошло до пророка Йакуба, который также завещал его своим сыновьям и потомкам."
            )
        ),
        .init(
            number: 132,
            arabic: "وَوَصَّى بِهَا إِبْرَاهِيمُ بَنِيهِ وَيَعْقُوبُ يَا بَنِيَّ إِنَّ اللّهَ اصْطَفَى لَكُمُ الدِّينَ فَلاَ تَمُوتُنَّ إَلاَّ وَأَنتُم مُّسْلِمُونَ",
            translation: "Ибраһим пәйгамбәр улларына һәм Ягъкуп пәйгамбәр дә үз балаларына шушы сүзләр белән васыять итте. Васыятьләре шул иде: «Әй минем улларым, дөреслектә, Аллаһы Тәгалә сезнең өчен Ислам динен ихтыяр итте. Мөселман булганыгыз хәлдә генә үлегез, ягъни Ислам динендә нык булыгыз һәм Исламнан аерылмагыз, дөньядан киткән вакытыгызда мөселман булып китегез».",
            transcription: "Үә үәссаа биһәә ибрааһиимү бәнииһи үә йәгкуубү йәә бәниййә иннә-ллааһә-сътафәә ләкүмү-ддиинә фәләә тәмүүтүннә илләә үә әңтүм мүслимүүн",
            tafsir: .init(
                author: "Ас-Саади",
                text: "О потомки Йакуба! Ваш предок завещал вам быть покорными Аллаху, и вы обязаны повиноваться ему самым совершенным образом и следовать путем последнего из пророков. Аллах оказал вам великую милость, когда избрал для вас религию. Выполняйте же предписания этой религии, соблюдайте ее нравственные нормы и не сходите с этого пути, пока вас не настигнет смерть. Если человек всю свою жизнь исповедует одни воззрения, то он умирает с ними. А если он умирает со своими воззрениями, то он не расстанется с ними и после воскрешения."
            )
        ),
        .init(
            number: 133,
            arabic: "أَمْ كُنتُمْ شُهَدَاء إِذْ حَضَرَ يَعْقُوبَ الْمَوْتُ إِذْ قَالَ لِبَنِيهِ مَا تَعْبُدُونَ مِن بَعْدِي قَالُواْ نَعْبُدُ إِلَهَكَ وَإِلَهَ آبَائِكَ إِبْرَاهِيمَ وَإِسْمَاعِيلَ وَإِسْحَقَ إِلَهًا وَاحِدًا وَنَحْنُ لَهُ مُسْلِمُونَ",
            translation: "Ягъкуп пәйгамбәргә үлем килгәндә, сез әзер идегезме? Шул вакытта Ягъкуп үзенең улларына: «Әй минем улларым, минем вафатымнан соң сез нәрсәгә гыйбадәт кылырсыз?» — диде. Ягъкуп пәйгамбәрнең уллары әйттеләр: «Без синең Аллаһыңа һәм аталарың Ибраһим, Исмәгыйль, Исхак пәйгамбәрләрнең Бер булучы Аллаһысына гыйбадәт кылырбыз. Без Ул Аллаһыга итагать итүчеләр».",
            transcription: "Әм күңтүм шүһәдәә’ә из хәдара йәгкуубәл-мәүтү из каалә либәнииһи мәә тәгбүдүүнә мим бәгдии каалүү нәгбүдү иләәһәкә үә иләәһә әәбәә’икә ибрааһиимә үә исмәәгиилә үә исхәәка иләәһәү үәәхидәү үә нәхнү ләһү мүслимүүн",
            tafsir: .init(
                author: "Ас-Саади",
                text: "Всевышний опроверг слова иудеев, которые заявляли, что они исповедуют религию Ибрахима и Йакуба. Разве они находились возле Ибрахима, когда смерть подступила к нему и он почувствовал ее приближение? В тот момент он решил испытать своих сыновей и получить удовольствие от их верности его завещанию. Он спросил: «Кому вы будете поклоняться после моей смерти?» Они сказали: «Мы будем поклоняться твоему Богу и Богу Ибрахима, Исмаила и Исхака. Мы не будем приобщать к Нему сотоварищей и не будем равнять с Ним творения. Мы всегда будем покорны Ему». Они обещали исповедовать единобожие и совершать праведные деяния, и такой ответ доставил ему великое удовольствие. Безусловно, иудеи не находились в этот момент рядом с Йакубом, поскольку в те далекие времена еще не было иудаизма. Аллах же поведал о том, что Йакуб заповедал своим сыновьям исповедовать единобожие, а не иудаизм."
            )
        )
    ]
)
