//
//  _3_Bakara.swift
//  DuaKit
//
//  Created by Khalil Sabirov on 03.11.2024.
//

import Foundation

let _3_Bakara: DuaModel = .init(
    name: .init(
        arabic: "",
        translation: "Бәкара"
    ),
    number: 2,
    firstSentenceNumber: 126,
    sentences: [
        .init(
            arabic: "الثَّمَرَاتِ مَنْ آمَنَ مِنْهُم بِاللّهِ وَالْيَوْمِ الآخِرِ قَالَ وَمَن كَفَرَ فَأُمَتِّعُهُ قَلِيلاً ثُمَّ أَضْطَرُّهُ إِلَى عَذَابِ النَّارِ وَبِئْسَ الْمَصِيرُ",
            translation: "Ибраһим пәйгамбәрнең ничек дога кылганын исегезгә төшерегез. «Әй минем Раббым, бу урынны иминлектә булучы шәһәр ит. Аллаһы Тәгаләгә һәм Ахирәт көненә ышанган шәһәр әһелләренә, анда торучыларга җимешләрдән ризык бир». Аллаһы Тәгалә Ибраһим хәзрәткә әйтте: «Кәфер булган кешене дөнья нигъмәтләре белән аз гына файдаландырырмын. Соңыннан бичаралык белән ут газабына сөрермен». Нинди яман кайтарылачак урын!",
            transcription: "Үә из каалә ибрааһиимү рабби-җгал һәәзәә бәләдән әәминәү-үәръзүкъ әһләһү минә-ссәмәраати мән әәмәнә минһүм билләәһи үәл-йәүмил-әәхыири каалә үә мәң кәфәра фә’үмәттигуһү калииләң сүммә әдтарруһүү иләә газәәби-ннәәри үә би’сәл-мәсыиир"
        ),
        .init(
            arabic: "وَإِذْ يَرْفَعُ إِبْرَاهِيمُ الْقَوَاعِدَ مِنَ الْبَيْتِ وَإِسْمَاعِيلُ رَبَّنَا تَقَبَّلْ مِنَّا إِنَّكَ أَنتَ السَّمِيعُ الْعَلِيمُ",
            translation: "Янә шул вакытны исегезгә төшерегез, Ибраһим пәйгамбәр белән Исмәгыйль Кәгъбәтулланың биналарын күтәрделәр. Кәгъбәтулла бинасын тәмамлагач, һәр икесе Аллаһы Тәгаләгә ялынып-ялварып әйттеләр: «Әй безнең Раббыбыз, Син бездән шушы хәерле эшебезне кабул ит. Дөреслектә, Син догаларыбызны ишетүче, ниятләребезне белүче».",
            transcription: "Үә из йәръфәгү ибрааһиимүл-каүәәгидә минәл-бәйти үә исмәәгыилү раббәнәә тәкаббәл миннәә иннәкә әңтә-ссәмиигүл-галиим"
        ),
        .init(
            arabic: "رَبَّنَا وَاجْعَلْنَا مُسْلِمَيْنِ لَكَ وَمِن ذُرِّيَّتِنَا أُمَّةً مُّسْلِمَةً لَّكَ وَأَرِنَا مَنَاسِكَنَا وَتُبْ عَلَيْنَآ إِنَّكَ أَنتَ التَّوَّابُ الرَّحِيمُ",
            translation: "Әй безнең Раббыбыз, һәр икебезне Ислам динендә нык торучы һәм ихлас ит. Безнең нәселләребездән булганнарны Сиңа итагать итүче итеп кыл. Янә безгә хаҗ гамәлләре эшләнә торган урыннарыбызны, ихрам, вокуф (тукталу), корбан урыннарын һәм башкаларны күрсәт, һәм Син безне кичер, гамәлдәге кимчелекләребезне гафу ит. Дөреслектә, Син тәүбәләрне кабул итүче, гөнаһлыларга рәхмәт кылучы.",
            transcription: "Раббәнәә үәҗгалнәә мүслимәйни ләкә үә миң зүрриййәтинәә үммәтәм мүслимәтәл-ләкә үә әринәә мәнәәсикәнәә үә түб галәйнәә иннәкә әңтә-ттәүүәәбү-ррахиим"
        ),
        .init(
            arabic: "رَبَّنَا وَابْعَثْ فِيهِمْ رَسُولاً مِّنْهُمْ يَتْلُو عَلَيْهِمْ آيَاتِكَ وَيُعَلِّمُهُمُ الْكِتَابَ وَالْحِكْمَةَ وَيُزَكِّيهِمْ إِنَّكَ أَنتَ العَزِيزُ الحَكِيمُ",
            translation: "Әй безнең Раббыбыз, алар арасыннан бер пәйгамбәрне кубар. Ул пәйгамбәр аларга Синең аятьләреңне укысын, Коръәннең мәгънәләрен һәм шәригать хөкемнәрен өйрәтсен. Янә аларны көфер һәм гөнаһлардан пакьләсен. Дөреслектә, Син — җиңүче һәм куәтле хикмәт иясе».",
            transcription: "Раббәнәә үәбгәс фииһим расүүләм-минһүм йәтлүү галәйһим әәйәәтикә үә йүгәллимүһүмүл-китәәбә үәл-хикмәтә үә йү-зәккииһим иннәкә әңтәл-газиизүл-хәкиим"
        ),
        .init(
            arabic: "وَمَن يَرْغَبُ عَن مِّلَّةِ إِبْرَاهِيمَ إِلاَّ مَن سَفِهَ نَفْسَهُ وَلَقَدِ اصْطَفَيْنَاهُ فِي الدُّنْيَا وَإِنَّهُ فِي الآخِرَةِ لَمِنَ الصَّالِحِينَ",
            translation: "Аның милләтеннән һичкем йөз чөермәс. Мәгәр үз нәфесләрен (эчке дөньясын) белмәүчеләр, ягъни дивана һәм гакылсыз, яисә үз-үзен һәлак кылучы гына йөз чөерер. Тәхкыйк, Без Ибраһимны дөньяда пәйгамбәрлек хәлил (дус) булу белән ихтыяр иттек. Дөреслектә, ул Ибраһим ахирәттә, әлбәттә, изгеләр җөмләсеннән булыр.",
            transcription: "Үә мәй йәръгабү гам-милләти ибрааһиимә илләә мәң сәфиһә нәфсәһү үә ләкадис-тафәйнәәһү фи-ддүнйәә үә иннәһү фил-әәхыйрати ләминә-ссалихиин"
        ),
        .init(
            arabic: "إِذْ قَالَ لَهُ رَبُّهُ أَسْلِمْ قَالَ أَسْلَمْتُ لِرَبِّ الْعَالَمِينَ",
            translation: "Шул вакыт Раббысы Ибраһимга әйтте: «Минем фәрманыма буйсын», — дип. Ибраһим г-м шул вакытта әйтте: «Мин үземне барча галәмнәрнең Раббысына тапшырдым һәм итагать итүче булдым».",
            transcription: "Из каалә ләһү раббүһү әслим каалә әсләмтү лираббил-гаәләмиин"
        ),
        .init(
            arabic: "وَوَصَّى بِهَا إِبْرَاهِيمُ بَنِيهِ وَيَعْقُوبُ يَا بَنِيَّ إِنَّ اللّهَ اصْطَفَى لَكُمُ الدِّينَ فَلاَ تَمُوتُنَّ إَلاَّ وَأَنتُم مُّسْلِمُونَ",
            translation: "Ибраһим пәйгамбәр улларына һәм Ягъкуп пәйгамбәр дә үз балаларына шушы сүзләр белән васыять итте. Васыятьләре шул иде: «Әй минем улларым, дөреслектә, Аллаһы Тәгалә сезнең өчен Ислам динен ихтыяр итте. Мөселман булганыгыз хәлдә генә үлегез, ягъни Ислам динендә нык булыгыз һәм Исламнан аерылмагыз, дөньядан киткән вакытыгызда мөселман булып китегез».",
            transcription: "Үә үәссаа биһәә ибрааһиимү бәнииһи үә йәгкуубү йәә бәниййә иннә-ллааһә-сътафәә ләкүмү-ддиинә фәләә тәмүүтүннә илләә үә әңтүм мүслимүүн"
        ),
        .init(
            arabic: "أَمْ كُنتُمْ شُهَدَاء إِذْ حَضَرَ يَعْقُوبَ الْمَوْتُ إِذْ قَالَ لِبَنِيهِ مَا تَعْبُدُونَ مِن بَعْدِي قَالُواْ نَعْبُدُ إِلَهَكَ وَإِلَهَ آبَائِكَ إِبْرَاهِيمَ وَإِسْمَاعِيلَ وَإِسْحَقَ إِلَهًا وَاحِدًا وَنَحْنُ لَهُ مُسْلِمُونَ",
            translation: "Ягъкуп пәйгамбәргә үлем килгәндә, сез әзер идегезме? Шул вакытта Ягъкуп үзенең улларына: «Әй минем улларым, минем вафатымнан соң сез нәрсәгә гыйбадәт кылырсыз?» — диде. Ягъкуп пәйгамбәрнең уллары әйттеләр: «Без синең Аллаһыңа һәм аталарың Ибраһим, Исмәгыйль, Исхак пәйгамбәрләрнең Бер булучы Аллаһысына гыйбадәт кылырбыз. Без Ул Аллаһыга итагать итүчеләр».",
            transcription: "Әм күңтүм шүһәдәә’ә из хәдара йәгкуубәл-мәүтү из каалә либәнииһи мәә тәгбүдүүнә мим бәгдии каалүү нәгбүдү иләәһәкә үә иләәһә әәбәә’икә ибрааһиимә үә исмәәгиилә үә исхәәка иләәһәү үәәхидәү үә нәхнү ләһү мүслимүүн"
        )
    ]
)
