//
//  _4_Bakara.swift
//  DuaKit
//
//  Created by Khalil Sabirov on 04.11.2024.
//

import Foundation

let _4_Bakara: DuaModel = .init(
    name: .init(
        arabic: "",
        translation: "Бәкара",
        alternative: "Фәзкүруунии"
    ),
    number: 2,
    sentences: [
        .init(
            number: 152,
            arabic: "فَاذْكُرُونِي أَذْكُرْكُمْ وَاشْكُرُوا لِي وَلَا تَكْفُرُونِ",
            translation: "Мине итагать итү һәм гыйбадәт кылу белән искә төшерегез, ә Мин сезне мәгъфирәт һәм рәхмәт белән искә төшерермен. Нигъмәтләрем бәрабәренә шөкрана кылыгыз һәм Миңа рәхмәтсезлек кылмагыз.",
            transcription: "Фәзкүруунии әзкүръкүм үәшкүруу лии үә ләә тәкфүруун"
        ),
        .init(
            number: 153,
            arabic: "يَا أَيُّهَا الَّذِينَ آمَنُوا اسْتَعِينُوا بِالصَّبْرِ وَالصَّلَاةِ إِنَّ اللَّهَ مَعَ الصَّابِرِينَ",
            translation: "Әй иман китерүчеләр, итагать һәм гыйбадәт белән яки бәлаләргә сабыр итү һәм намаз уку белән ярдәм сорагыз. Дөреслектә, Аллаһы Тәгалә сабыр итүчеләр белән.",
            transcription: "Йәә әййүһә-лләзиинә әәмәнү-стәгыинүү биссабри үә-ссаләәти иннә-ллааһә мәгә-ссаабириин"
        ),
        .init(
            number: 154,
            arabic: "وَلَا تَقُولُوا لِمَن يُقْتَلُ فِي سَبِيلِ اللَّهِ أَمْوَاتٌ بَلْ أَحْيَاءٌ وَلَكِن لَّا تَشْعُرُونَ",
            translation: "Аллаһы Тәгалә юлында үтерелгән кешеләргә «үлекләр» дип әйтмәгез. Алар үлек түгел, бәлки Аллаһы Тәгалә каршында теректер. Ләкин сез аларның терек икәнлекләрен белмәссез.",
            transcription: "Үә ләә тәкуулүү лимәй йүктәлү фии сәбиили-лләәһи әмүәәтүм бәл әхйәә’үү үә ләәкил-ләә тәшгуруун"
        ),
        .init(
            number: 155,
            arabic: "وَلَنَبْلُوَنَّكُم بِشَيْءٍ مِّنَ الْخَوْفِ وَالْجُوعِ وَنَقْصٍ مِّنَ الْأَمْوَالِ وَالْأَنفُسِ وَالثَّمَرَاتِ وَبَشِّرِ الصَّابِرِينَ",
            translation: "Әлбәттә, Без сезне куркыныч бер нәрсә белән сынарбыз һәм ачлык белән сынарбыз. Янә малларда һәм нәфесләрдә кимлек, янә җимешләрдә кимлек белән сынарбыз. Сабыр итүчеләргә һәртөрле бәхет һәм бүләкләр белән сөенеч бирербез.",
            transcription: "Үә ләнәблүүәннәкүм бишәй’им-минәл-хауфи үәл-җүүгы үә нәкъсыим-минәл-әмүәәли үәл-әңфүси үә-ссәмәраати үә бәшшири-ссаабириин"
        ),
        .init(
            number: 156,
            arabic: "الَّذِينَ إِذَا أَصَابَتْهُم مُّصِيبَةٌ قَالُوا إِنَّا لِلَّهِ وَإِنَّا إِلَيْهِ رَاجِعُونَ",
            translation: "Сабыр итүчеләргә кайгы ирешсә, һәркайчан әйтерләр: «Дөреслектә, без Аллаһы Тәгаләнеке һәм, дөреслектә, без Ул Аллаһы Тәгаләгә кайтачакбыз».",
            transcription: "Әлләзиинә изәә әсаабәтһүм мүсыиибәтүң каалүү иннәә лилләәһи үә иннә иләйһи рааҗигүүн"
        ),
        .init(
            number: 157,
            arabic: "أُولَئِكَ عَلَيْهِمْ صَلَوَاتٌ مِّن رَّبِّهِمْ وَرَحْمَةٌ وَأُولَئِكَ هُمُ الْمُهْتَدُونَ",
            translation: "Шушы төркемгә Раббыларыннан рәхмәт һәм нигъмәтләр булыр. Бу төркем — тәкъдиргә риза булып, авырлык килгәндә сабыр итүләре сәбәпле, туры юлга күнүчеләр.",
            transcription: "Үләә’икә гәләйһим саләүәәтүм мир-раббиһим үә рахмәтүв үә үләә’икә һүмүл-мүһтәдүүн"
        ),
    ]
)
