//
//  _5_Bakara.swift
//  DuaKit
//
//  Created by Khalil Sabirov on 04.11.2024.
//

import Foundation

let _5_Bakara: DuaModel = .init(
    name: .init(
        arabic: "",
        translation: "Бәкара",
        alternative: "Шәһру Рамазан"
    ),
    sentences: [
        .init(
            number: 183,
            arabic: "يَا أَيُّهَا الَّذِينَ آمَنُوا كُتِبَ عَلَيْكُمُ الصِّيَامُ كَمَا كُتِبَ عَلَى الَّذِينَ مِن قَبْلِكُمْ لَعَلَّكُمْ تَتَّقُونَ",
            translation: "Әй иман китерүчеләр! Әүвәлге өммәтләргә фарыз ителгән кебек, сезгә дә ураза тоту фарыз ителде. Шаять, ураза тоту сәбәпле, гөнаһлардан сакланырсыз.",
            transcription: "Йәә әййүһә-лләзиинә әәмәнүү күтибә галәйкүмү-ссыийәәмү кәмәә күтибә галә-лләзиинә миң кабликүм ләгәлләкүм тәттәкуун"
        ),
        .init(
            number: 184,
            arabic: "أَيَّامًا مَّعْدُودَاتٍ فَمَن كَانَ مِنكُم مَّرِيضًا أَوْ عَلَى سَفَرٍ فَعِدَّةٌ مِّنْ أَيَّامٍ أُخَرَ وَعَلَى الَّذِينَ يُطِيقُونَهُ فِدْيَةٌ طَعَامُ مِسْكِينٍ فَمَن تَطَوَّعَ خَيْرًا فَهُوَ خَيْرٌ لَّهُ وَأَن تَصُومُوا خَيْرٌ لَّكُمْ إِن كُنتُمْ تَعْلَمُونَ",
            translation: "Саналган берничә көндә ураза тотыгыз. Кеше ул көндә сырхау, яисә сәфәрдә булса, ул башка көннәрдә шул көннәрнең саны кадәр ураза тотар. Ураза тотуга көчләре җитмәүчеләргә ураза тоту урынына бер фәкыйрьнең бер көнлек ашы кадәр фидия бирү лязем. Һәркем үз теләге белән изгелеген арттырса, ягъни фидияне искә алынган микъдардан артык итеп бирсә, ул эш аның өчен изгерәк. Әгәр уразаның фазыйләтен белгән булсагыз, сезнең өчен тотмаска рөхсәт була торып, ураза тотуыгыз, ураза тотмыйча фидия бирүдән яки соңыннан каза кылуыгыздан изгерәк һәм артыграк.",
            transcription: "Әййәәмәм мәгдүүдәәтиң фәмәң кәәнә миңкүм мәриидан әү галәә сәфәриң фәгыддәтүм мин әййәәмин үхара үә галә-лләзиинә йүтыиикуунәһү фидйәтүң тагаәмү мискииниң фәмәң тәтаүүәга хайраң фәһүүә хайруль-ләһү үә әң тәсуумүү хайруль-ләкүм иң күңтүм тәг-ләмүүн"
        ),
        .init(
            number: 185,
            arabic: "شَهْرُ رَمَضَانَ الَّذِي أُنزِلَ فِيهِ الْقُرْآنُ هُدًى لِّلنَّاسِ وَبَيِّنَاتٍ مِّنَ الْهُدَى وَالْفُرْقَانِ فَمَن شَهِدَ مِنكُمُ الشَّهْرَ فَلْيَصُمْهُ وَمَن كَانَ مَرِيضًا أَوْ عَلَى سَفَرٍ فَعِدَّةٌ مِّنْ أَيَّامٍ أُخَرَ يُرِيدُ اللَّهُ بِكُمُ الْيُسْرَ وَلَا يُرِيدُ بِكُمُ الْعُسْرَ وَلِتُكْمِلُوا الْعِدَّةَ وَلِتُكَبِّرُوا اللَّهَ عَلَى مَا هَدَاكُمْ وَلَعَلَّكُمْ تَشْكُرُونَ",
            translation: "Бу зекер ителгән көннәр рамазан аедыр, ул айда Коръән иңдерелде. Ул Коръән адәмнәр өчен туры юлны күрсәткән һәм ачык дәлилләре булганы хәлдә, хәләл, хәрам һәм башка хөкемнәр белән, янә хак һәм батыйль арасын аеручы булып иңде. Һәркем сездән әзер булса, ягъни рамазан аенда шәһәрдә торучы булса, ул айда ураза тотсын, һәркем сырхау яисә сәфәрдә булса, андый кешеләргә ураза тотмаска рөхсәт ителә. Аларга калган уразаларның казасын шул көннәр кадәр башка көннәрдә тоту лязем. Аллаһы Тәгалә сезгә җиңеллек теләр, авырлык һәм читенлекне теләмәс. Аллаһы Тәгалә сезнең уразагызны камил кылуыгызны һәм тәмамлавыгызны теләр. Янә сезне туры юлга күндергәне өчен сезнең Аллаһы Тәгаләне олуглык белән искә алуыгызны яки гает намазында аңа тәкбир әйтүегезне теләр. Шаять, сез Аллаһы Тәгаләнең нигъмәтләренә шөкрана кылырсыз.",
            transcription: "Шәһру рамәдаанә-лләзии үңзилә фииһил-кур’әәнү һүдәл-линнәәси үә бәййинәәтим-минәл-һүдәә үәл-фүръкаани фәмәң шәһидә миңкүмү-шшәһра фәлйәсумһү үә мәң кәәнә мәриидан әү галәә сәфәриң фәгиддәтүм-мин әййәәмин үхара йүриидү-ллааһү бикүмүл-йүсра үә ләә йүриидү бикүмүл-гүсра үә литүкмилүл-гиддәтә үә литүкәббиру-ллааһә галәә мәә һәдәәкүм үә ләгалләкүм тәшкүруун"
        ),
        .init(
            number: 186,
            arabic: "وَإِذَا سَأَلَكَ عِبَادِي عَنِّي فَإِنِّي قَرِيبٌ أُجِيبُ دَعْوَةَ الدَّاعِ إِذَا دَعَانِ فَلْيَسْتَجِيبُوا لِي وَلْيُؤْمِنُوا بِي لَعَلَّهُمْ يَرْشُدُونَ",
            translation: "Әй Мөхәммәт г-м, һәркайчан синнән бәндәләрем Минем сыйфатларым турында сорасалар, дөреслектә, Мин аларга гыйлем белән якынмын: «Һәркайчан Миңа эндәшүче эндәшсә, аның эндәшүен кабул итәрмен һәм җавап бирермен, Минем бәндәләрем җавап бирүне теләсеннәр һәм кабул итүне сорасыннар, иманнарында нык торсыннар яки догаларының кабул булуына ышансыннар. Шаять, алар туры юлга күнәрләр һәм туры юлда нык булырлар.",
            transcription: "Үә изәә сә’әләкә гибәәдии гәннии фә’иннии кариибүн үҗиибү дәгүәтә-ддәәги изәә дәгаәни фәлйәс­тәҗиибүү лии үәл-йү’минүү бии ләгалләһүм йәршүдүүн"
        ),
    ]
)
