//
//  _6_Bakara.swift
//  DuaKit
//
//  Created by Khalil Sabirov on 04.11.2024.
//

import Foundation

let _6_Bakara: DuaModel = .init(
    name: .init(
        arabic: "",
        translation: "Бәкара",
        alternative: "Раббәнә"
    ),
    sentences: [
        .init(
            number: 201,
            arabic: "وَمِنْهُم مَّن يَقُولُ رَبَّنَا آتِنَا فِي الدُّنْيَا حَسَنَةً وَفِي الْآخِرَةِ حَسَنَةً وَقِنَا عَذَابَ النَّارِ",
            translation: "Адәмнәрдән шул кешеләр бар, алар: «Әй безнең Раббыбыз, безгә дөньяда изгелектән һәм ахирәттә изгелекне бир. Син безне тәмуг уты газабыннан сакла», — дип әйтерләр.",
            transcription: "Үә минһүм мәй йәкуулү раббәнәә әәтинәә фи-ддүнйәә хәсәнәтәү үә фил-әәхыирати хәсәнәтәү үә кыйнәә газәәбә-ннәәр"
        )
    ]
)
